In [24]:
import pandas as pd

In [29]:
imdb_df = pd.read_csv('imdb_df.csv')
imdb_df.head()

,movie_id,title,year,genres,runtime,person_id,name,category,averagerating,numvotes
0,tt7131622,once upon a time ... in hollywood,2019,Comedy,159.0,nm0000093,Brad Pitt,actor,9.7,5600
1,tt7131622,once upon a time ... in hollywood,2019,Drama,159.0,nm0000093,Brad Pitt,actor,9.7,5600
2,tt7131622,once upon a time ... in hollywood,2019,Comedy,159.0,nm0000138,Leonardo DiCaprio,actor,9.7,5600
3,tt7131622,once upon a time ... in hollywood,2019,Drama,159.0,nm0000138,Leonardo DiCaprio,actor,9.7,5600
4,tt7131622,once upon a time ... in hollywood,2019,Comedy,159.0,nm0000233,Quentin Tarantino,director,9.7,5600

In [30]:
tn_df = pd.read_csv('tn_df.csv')
tn_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Year,month
0,2,"May 20, 2011",pirates of the caribbean: on stranger tides,410600000,241063875,1045663875,2011,May
1,3,"Jun 7, 2019",dark phoenix,350000000,42762350,149762350,2019,Jun
2,4,"May 1, 2015",avengers: age of ultron,330600000,459005868,1403013963,2015,May
3,5,"Dec 15, 2017",star wars ep. viii: the last jedi,317000000,620181382,1316721747,2017,Dec
4,6,"Dec 18, 2015",star wars ep. vii: the force awakens,306000000,936662225,2053311220,2015,Dec

In [31]:
df = imdb_df.merge(tn_df, how = 'inner', left_on = 'title', right_on = 'movie')
df.head()

,movie_id,title,year,genres,runtime,person_id,name,category,averagerating,numvotes,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,Year,month
0,tt1375666,inception,2010,Action,148.0,nm0000138,Leonardo DiCaprio,actor,8.8,1841066,38,"Jul 16, 2010",inception,160000000,292576195,835524642,2010,Jul
1,tt1375666,inception,2010,Adventure,148.0,nm0000138,Leonardo DiCaprio,actor,8.8,1841066,38,"Jul 16, 2010",inception,160000000,292576195,835524642,2010,Jul
2,tt1375666,inception,2010,Sci-Fi,148.0,nm0000138,Leonardo DiCaprio,actor,8.8,1841066,38,"Jul 16, 2010",inception,160000000,292576195,835524642,2010,Jul
3,tt1375666,inception,2010,Action,148.0,nm0330687,Joseph Gordon-Levitt,actor,8.8,1841066,38,"Jul 16, 2010",inception,160000000,292576195,835524642,2010,Jul
4,tt1375666,inception,2010,Adventure,148.0,nm0330687,Joseph Gordon-Levitt,actor,8.8,1841066,38,"Jul 16, 2010",inception,160000000,292576195,835524642,2010,Jul

In [32]:
drop = ['movie_id', 'person_id', 'id', 'year', 'movie']
df.drop(columns = drop, inplace = True)
df.head()

,title,genres,runtime,name,category,averagerating,numvotes,release_date,production_budget,domestic_gross,worldwide_gross,Year,month
0,inception,Action,148.0,Leonardo DiCaprio,actor,8.8,1841066,"Jul 16, 2010",160000000,292576195,835524642,2010,Jul
1,inception,Adventure,148.0,Leonardo DiCaprio,actor,8.8,1841066,"Jul 16, 2010",160000000,292576195,835524642,2010,Jul
2,inception,Sci-Fi,148.0,Leonardo DiCaprio,actor,8.8,1841066,"Jul 16, 2010",160000000,292576195,835524642,2010,Jul
3,inception,Action,148.0,Joseph Gordon-Levitt,actor,8.8,1841066,"Jul 16, 2010",160000000,292576195,835524642,2010,Jul
4,inception,Adventure,148.0,Joseph Gordon-Levitt,actor,8.8,1841066,"Jul 16, 2010",160000000,292576195,835524642,2010,Jul